* International Education
| Start Age | Grade | Fee |
|         3 |       |     |
|         4 | k1    |  30 |
|         5 | k2    |  30 |
|         6 | G1    |  30 |
|         7 | G2    |  30 |
|         8 | G3    |  30 |
|         9 | G4    |  30 |
|        10 | G5    |  30 |
|        11 | G6    |  30 |
|        12 | G7    |  30 |
|        13 | G8    |  30 |
|        14 | G9    |  30 |
|        15 | G10   |  30 |
|        16 | G11   |  30 |
|        17 | G12   |  30 |
|        18 | U1    |  30 |
|        19 | U2    |  30 |
|        20 | U3    |  30 |
|        21 | U4    |  30 |
|           | TOTAL | 540 |
#+TBLFM: @21$3=vsum(@2$3..@20$3)

Reference : http://www.cis.edu.sg/page.cfm?p=382
